app/controllers/visitors_controller.rb

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @visitor = Visitor.find(params[:id])

INSERT INTO "visitors" ("fullname", "nric", "temperature", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fullname", "Carmen"], ["nric", 123456789000], ["temperature", "23"], ["date", "23"], ["time", "3"], ["created_at", "2020-11-27 08:00:04.986482"], ["updated_at", "2020-11-27 08:00:04.986482"]]
---
  def create
    @visitor = Visitor.new(visitor_params)

    if @visitor.save